<a href="https://colab.research.google.com/github/Settee-ake/DB_Project/blob/main/db_Project.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# Database Foundation Project
#-----------------------
# Name: Settee Chaitragool
# ID: 6281551
#-----------------------

In [64]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [75]:
%%sql
postgresql://dbfinal_tci6_user:RpJ2veIwES5h5di6aT3Av0AnYriw0ned@dpg-co4qh0q1hbls73c0kpc0-a.singapore-postgres.render.com/dbfinal_tci6

In [76]:
%%sql

-- Table of `location` --------------------------
DROP TABLE IF EXISTS location;

CREATE TABLE IF NOT EXISTS location (
  id SERIAL PRIMARY KEY,
  street_address VARCHAR(100) NOT NULL,
  city VARCHAR(50) NOT NULL,
  state VARCHAR(2) NOT NULL,
  zipcode INT NOT NULL UNIQUE
);

-- Table of `vehicle_type` --------------------------
DROP TABLE IF EXISTS vehicle_type;

CREATE TABLE IF NOT EXISTS vehicle_type (
  id SERIAL PRIMARY KEY,
  name VARCHAR(45) NOT NULL UNIQUE
);

-- Table of `vehicle` --------------------------
DROP TABLE IF EXISTS vehicle;

CREATE TABLE IF NOT EXISTS vehicle (
  id SERIAL PRIMARY KEY,
  brand VARCHAR(45) NOT NULL,
  model VARCHAR(45) NOT NULL,
  model_year INT NOT NULL,
  mileage INT NOT NULL CHECK (mileage >= 0),
  color VARCHAR(45) NOT NULL,
  vehicle_type_id INT NOT NULL,
  current_location_id INT NOT NULL,
  rental_price DECIMAL(13,2) NOT NULL CHECK (rental_price >= 0),
  FOREIGN KEY (vehicle_type_id) REFERENCES vehicle_type (id) ON DELETE RESTRICT ON UPDATE CASCADE,
  FOREIGN KEY (current_location_id) REFERENCES location (id) ON DELETE RESTRICT ON UPDATE CASCADE
);

-- Table of `customer` --------------------------
DROP TABLE IF EXISTS customer;

CREATE TABLE IF NOT EXISTS customer (
  id SERIAL PRIMARY KEY,
  first_name VARCHAR(45) NOT NULL,
  last_name VARCHAR(45) NOT NULL,
  birth_date DATE NOT NULL,
  license_number VARCHAR(12) NOT NULL UNIQUE,
  phone_number VARCHAR(12),
  email VARCHAR(255) NOT NULL UNIQUE
);

-- Table of `fuel_option` --------------------------
DROP TABLE IF EXISTS fuel_option;

CREATE TABLE IF NOT EXISTS fuel_option (
  id SERIAL PRIMARY KEY,
  name VARCHAR(45) NOT NULL,
  description VARCHAR(255)
);

-- Table of `rental` --------------------------
DROP TABLE IF EXISTS rental;

CREATE TABLE IF NOT EXISTS rental (
  id SERIAL PRIMARY KEY,
  begin_date DATE NOT NULL,
  end_date DATE NOT NULL,
  customer_id INT NOT NULL,
  vehicle_type_id INT NOT NULL,
  fuel_option_id INT NOT NULL,
  pickup_location_id INT NOT NULL,
  drop_off_location_id INT NOT NULL,
  FOREIGN KEY (customer_id) REFERENCES customer (id) ON DELETE RESTRICT ON UPDATE CASCADE,
  FOREIGN KEY (fuel_option_id) REFERENCES fuel_option (id) ON DELETE RESTRICT ON UPDATE CASCADE,
  FOREIGN KEY (pickup_location_id) REFERENCES location (id) ON DELETE RESTRICT ON UPDATE CASCADE,
  FOREIGN KEY (drop_off_location_id) REFERENCES location (id) ON DELETE RESTRICT ON UPDATE CASCADE,
  FOREIGN KEY (vehicle_type_id) REFERENCES vehicle_type (id) ON DELETE RESTRICT ON UPDATE CASCADE
);

-- to filter out underage driver
CREATE OR REPLACE FUNCTION age_check_function()
RETURNS TRIGGER AS $$
BEGIN
  IF (NEW.birth_date > (CURRENT_DATE - INTERVAL '21 years')) THEN
    RAISE EXCEPTION 'You are too young to drive bro~';
  END IF;
  RETURN NEW;
END;
$$ LANGUAGE plpgsql;

-- trigger
DROP TRIGGER IF EXISTS age_check ON customer;
CREATE TRIGGER age_check
BEFORE INSERT ON customer
FOR EACH ROW
EXECUTE FUNCTION age_check_function();

   postgresql://dbfinal_33vl_user:***@dpg-co4ophv79t8c73958bm0-a.oregon-postgres.render.com/dbfinal_33vl
   postgresql://dbfinal_7mjj_user:***@dpg-co4qcmq1hbls73c0int0-a.singapore-postgres.render.com/dbfinal_7mjj
   postgresql://dbfinal_dru1_user:***@dpg-co4qg3f79t8c7395ur9g-a.singapore-postgres.render.com/dbfinal_dru1
   postgresql://dbfinal_lkac_user:***@dpg-co4or2v79t8c73958vfg-a.oregon-postgres.render.com/dbfinal_lkac
 * postgresql://dbfinal_tci6_user:***@dpg-co4qh0q1hbls73c0kpc0-a.singapore-postgres.render.com/dbfinal_tci6
   postgresql://noname_yvld_user:***@dpg-co4olkf79t8c73956pr0-a.singapore-postgres.render.com/noname_yvld
   postgresql://root:***@dpg-cmivnva1hbls738gohn0-a.singapore-postgres.render.com/remote_pg_db_a8sj
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [77]:
%%sql

--dummy data ----------------------------

BEGIN;
INSERT INTO location (id, street_address, city, state, zipcode) VALUES (1, '1001 Henderson St', 'Fort Worth', 'TX', 46782);
INSERT INTO location (id, street_address, city, state, zipcode) VALUES (2, '300 Reunion Blvd', 'Dallas', 'TX', 41234);
INSERT INTO location (id, street_address, city, state, zipcode) VALUES (3, '5911 Blair Rd NW', 'Washington', 'DC', 53454);
INSERT INTO location (id, street_address, city, state, zipcode) VALUES (4, '9217 Airport Blvd', 'Los Angeles', 'CA', 86453);
INSERT INTO location (id, street_address, city, state, zipcode) VALUES (5, '310 E 64th St', 'New York', 'NY', 54352);
INSERT INTO location (id, street_address, city, state, zipcode) VALUES (6, '1011 Pike St', 'Seattle', 'WA', 42345);
INSERT INTO location (id, street_address, city, state, zipcode) VALUES (7, '5150 W 55th St', 'Chicago', 'IL', 06785);
COMMIT;

-- -----------------------------------------------------
-- Data for table `vehicle_type`
-- -----------------------------------------------------
BEGIN;
INSERT INTO vehicle_type (id, name) VALUES (1, 'Economy');
INSERT INTO vehicle_type (id, name) VALUES (2, 'Intermediate');
INSERT INTO vehicle_type (id, name) VALUES (3, 'Standard');
INSERT INTO vehicle_type (id, name) VALUES (4, 'Economy SUV');

COMMIT;

-- -----------------------------------------------------
-- Data for table `vehicle`
-- -----------------------------------------------------
BEGIN;
INSERT INTO vehicle (id, brand, model, model_year, mileage, color, vehicle_type_id, current_location_id, rental_price) VALUES (1, 'Nissan', 'Versa', 2016, 65956, 'white', 1, 1, 1200.50);
INSERT INTO vehicle (id, brand, model, model_year, mileage, color, vehicle_type_id, current_location_id, rental_price) VALUES (2, 'Mitsubishi', 'Mirage', 2017, 55864, 'light blue', 1, 6,1350.00);
INSERT INTO vehicle (id, brand, model, model_year, mileage, color, vehicle_type_id, current_location_id, rental_price) VALUES (3, 'Chevrolet', 'Cruze', 2017, 45796, 'dark gray', 2, 5,2059.99);
INSERT INTO vehicle (id, brand, model, model_year, mileage, color, vehicle_type_id, current_location_id, rental_price) VALUES (4, 'Hyundai', 'Elantra', 2018, 35479, 'black', 2, 1, 2999.89);
INSERT INTO vehicle (id, brand, model, model_year, mileage, color, vehicle_type_id, current_location_id, rental_price) VALUES (5, 'Volkswagen', 'Jetta', 2019, 2032, 'light gray', 3, 3, 4000.00);
INSERT INTO vehicle (id, brand, model, model_year, mileage, color, vehicle_type_id, current_location_id, rental_price) VALUES (6, 'Toyota', 'RAV4', 2018, 12566, 'white', 4, 7, 2555.25);

COMMIT;

-- -----------------------------------------------------
-- Data for table `customer`
-- -----------------------------------------------------
BEGIN;
INSERT INTO customer (id, first_name, last_name, birth_date, license_number, phone_number, email) VALUES (1, 'Kelby', 'Matterdace', '1974-05-22', 'V435899293', '181-441-7828', 'kmatterdace0@oracle.com');
INSERT INTO customer (id, first_name, last_name, birth_date, license_number, phone_number, email) VALUES (2, 'Orion', 'De Hooge', '1992-08-07', 'Z140530509', '948-294-5458', 'odehooge1@quantcast.com');
INSERT INTO customer (id, first_name, last_name, birth_date, license_number, phone_number, email) VALUES (3, 'Sheena', 'Macias', '1981-03-10', 'W045654959', '625-622-6872', 'smacias3@amazonaws.com');
INSERT INTO customer (id, first_name, last_name, birth_date, license_number, phone_number, email) VALUES (4, 'Irving', 'Packe', '1994-12-19', 'O232196823', '157-815-8064',  'ipacke4@cbc.ca');
INSERT INTO customer (id, first_name, last_name, birth_date, license_number, phone_number, email) VALUES (5, 'Kass', 'Humphris', '1993-12-16', 'G055017319', '510-624-4189', 'khumphris5@xrea.com');

COMMIT;


-- -----------------------------------------------------
-- Data for table `fuel_option`
-- -----------------------------------------------------
BEGIN;
INSERT INTO fuel_option (id, name) VALUES (1, 'Pre-pay' );
INSERT INTO fuel_option (id, name) VALUES (2, 'Self-Service');
INSERT INTO fuel_option (id, name) VALUES (3, 'Market');

COMMIT;


-- -----------------------------------------------------
-- Data for table `rental`
-- -----------------------------------------------------
BEGIN;
INSERT INTO rental (id, begin_date, end_date, customer_id, vehicle_type_id, fuel_option_id, pickup_location_id, drop_off_location_id) VALUES (1, '2018-07-14', '2018-07-23', 1, 2, 1, 3, 5);
INSERT INTO rental (id, begin_date, end_date, customer_id, vehicle_type_id, fuel_option_id, pickup_location_id, drop_off_location_id) VALUES (2, '2018-07-10', '2018-07-12', 2, 1, 2, 1, 2);
INSERT INTO rental (id, begin_date, end_date, customer_id, vehicle_type_id, fuel_option_id, pickup_location_id, drop_off_location_id) VALUES (3, '2018-06-15', '2018-07-20', 3, 1, 3, 4, 6);
INSERT INTO rental (id, begin_date, end_date, customer_id, vehicle_type_id, fuel_option_id, pickup_location_id, drop_off_location_id) VALUES (4, '2018-06-09', '2018-07-02', 4, 4, 2, 2, 7);
INSERT INTO rental (id, begin_date, end_date, customer_id, vehicle_type_id, fuel_option_id, pickup_location_id, drop_off_location_id) VALUES (5, '2018-07-24', '2018-07-27', 5, 3, 3, 5, 3);

COMMIT;

   postgresql://dbfinal_33vl_user:***@dpg-co4ophv79t8c73958bm0-a.oregon-postgres.render.com/dbfinal_33vl
   postgresql://dbfinal_7mjj_user:***@dpg-co4qcmq1hbls73c0int0-a.singapore-postgres.render.com/dbfinal_7mjj
   postgresql://dbfinal_dru1_user:***@dpg-co4qg3f79t8c7395ur9g-a.singapore-postgres.render.com/dbfinal_dru1
   postgresql://dbfinal_lkac_user:***@dpg-co4or2v79t8c73958vfg-a.oregon-postgres.render.com/dbfinal_lkac
 * postgresql://dbfinal_tci6_user:***@dpg-co4qh0q1hbls73c0kpc0-a.singapore-postgres.render.com/dbfinal_tci6
   postgresql://noname_yvld_user:***@dpg-co4olkf79t8c73956pr0-a.singapore-postgres.render.com/noname_yvld
   postgresql://root:***@dpg-cmivnva1hbls738gohn0-a.singapore-postgres.render.com/remote_pg_db_a8sj
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[]

In [47]:
%%sql
SELECT * FROM customer;

 * postgresql://root:***@dpg-cmivnva1hbls738gohn0-a.singapore-postgres.render.com/remote_pg_db_a8sj
0 rows affected.

[]